package com.islamik.amol

import android.content.Intent
import android.graphics.Color
import android.graphics.drawable.ColorDrawable
import android.os.Bundle
import android.os.Handler
import android.widget.Toast
import androidx.appcompat.app.AppCompatActivity
import com.github.islamkhsh.CardSliderViewPager
import kotlinx.android.synthetic.main.activity_main.*
import java.util.*


class MainActivity : AppCompatActivity() {

    private var doubleBackToExitPressedOnce = false

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)

        val movies1 = arrayListOf<Movie>()
        val movies = arrayListOf<Movie>()
        supportActionBar?.setBackgroundDrawable( ColorDrawable(Color.parseColor("#000000")))
        supportActionBar?.setTitle("আমল সমুহ")










       movies1.add( Movie("প্রত্যেক ওযুর পর কালেমা শাহাদত পাঠ করুণ (আশ্হাদু আল্লা-ইলাহা ইল্লাল্লাহু ওয়াহ্দাহু লা- শারী কা লাহূ ওয়া আশহাদু আন্না মুহাম্মাদান ‘আব্দুহূ ওয়া রাসূলুহূ) । এতে জান্নাতের ৮টি দরজার যে কোন দরজা দিয়ে প্রবেশ করতে পারবেন। সহিহ মুসলিম, হাদিস নং- ২৩৪।"))
       movies1.add( Movie("প্রত্যেক ফরজ সলাত শেষে আয়াতুল কুরসি পাঠ করুণ এতে মৃত্যুর সাথে সাথে জান্নাতে যেতে পারবেন। সহিহ নাসাই, সিলসিলাহ সহিহাহ, হাদিস নং- ৯৭২।"))
       movies1.add( Movie("প্রত্যেক ফরজ সলাত শেষে ৩৩ বার সুবহানাল্লাহ, ৩৩ বার আলহামদুলিল্লাহ্, ৩৩ বার আল্লাহু আকবার এবং ১ বার (লা ইলা-হা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু, লাহুল মুলকু ওয়ালাহুল হামদু ওয়াহুয়া ‘আলা কুল্লি শাই’ইন কাদীর) পাঠ করুণ এতে আপনার অতীতের সব পাপ ক্ষমা হয়ে যাবে। সহিহ মুসলিম, হাদিস নং- ১২২৮। সেই সাথে জাহান্নাম থেকেও মুক্তি পেয়ে যাবেন কেননা দিনে ৩৬০ বার এই তাসবিহগুলো পড়লেই জাহান্নাম থেকে মুক্ত রাখা হয় আর এভাবে ৫ ওয়াক্তে ৫০০ বার পড়া হচ্ছে। সহিহ মুসলিম, মিশকাত হাদিস নং- ১৮০৩) ।"))
       movies1.add( Movie("প্রতিরাতে সূরা মুলক পাঠ করুণ এতে কবরের শাস্তি থেকে মুক্তি পেয়ে যাবেন। সহিহ নাসাই, সহিহ তারগিব, হাকিম হাদিস নং- ৩৮৩৯, সিলসিলাহ সহিহাহ, হাদিস নং- ১১৪০।"))
       movies1.add( Movie("রাসুল (সাঃ)-এর উপর সকালে ১০ বার ও সন্ধ্যায় ১০ বার দরুদ পড়ুন এতে আপনি নিশ্চিত রাসুল (সাঃ)-এর সুপারিশ পাবেন। তবরানি, সহিহ তারগিব, হাদিস নং- ৬৫৬ ।"))
       movies1.add( Movie("সকালে ও বিকালে ১০০ বার সুবহানাল্লাহ, ১০০ বার আলহামদুলিল্লাহ্, ১০০ বার আল্লাহু আকবার এবং ১০০ বার লা ইলা-হা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু, লাহুল মুলকু ওয়ালাহুল হামদু ওয়াহুয়া ‘আলা কুল্লি শাই’ইন কাদীর পাঠ করলে অগণিত সওয়াব হবে। নাসাই, সহিহ তারগিব, হাদিস নং- ৬৫১।"))
       movies1.add( Movie("বাজারে প্রবেশ করে- (লা ইলা-হা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু, লাহুল মুলকু ওয়ালাহুল হামদু য়্যুহয়ী ওয়া য়্যুমীতু ওয়া হুয়া হাইয়ুল লা য়্যামূত, বিয়াদিহিল খাইরু ওয়াহুয়া ‘আলা কুল্লি শাই’ইন কাদীর)পাঠ করুণ এতে ১০ লক্ষ পুণ্য হবে, ১০ লক্ষ পাপ মোচন হবে, ১০ লক্ষ মর্যাদা বৃদ্ধি হবে এবং জান্নাতে আপনার জন্য ১ টি গৃহ নির্মাণ করা হবে। তিরমিজি, হাদিস নং- ৩৪২৮,৩৪২৯।"))
       movies1.add( Movie("বাড়িতে সালাম দিয়ে প্রবেশ করুণ এতে আল্লাহ তা’লা নিজ জিম্মাদারিতে আপনাকে জান্নাতে প্রবেশ করাবেন। ইবনু হিব্বান, হাদিস নং- ৪৯৯, সহিহ তারগিব, হাদিস নং- ৩১৬।"))
       movies1.add( Movie("জামাতে ইমামের প্রথম তাকবীরের সাথে ৪০ দিন সলাত আদায় করুন এতে আপনি নিশ্চিত জাহান্নাম থেকে মুক্তি পেয়ে যাবেন। তিরমিজি, সিলসিলাহ সহিহাহ, হাদিস নং- ৭৪৭, সহিহ তারগিব, হাদিস নং- ৪০৪)।"))
       movies1.add( Movie("প্রতিমাসের আয়ের একটা অংশ এতিমখানা বা মসজিদ মাদ্রাসা বা গরিব-দুখি, বিধবা ও দুস্থদের মাঝে দান করবেন হোক সেটা অতি অল্প এতে আপনি আল্লাহ তা’লার কাছে জিহাদকারির সমতুল্য হবেন। সহিহ বুখারি, হাদিস নং- ৬০০৭।"))
       movies1.add( Movie("মহিলারা ৪টি কাজ করবেন, ১- ৫ ওয়াক্ত সলাত ২- রমজানের সিয়াম, ৩- লযযাস্থানের হেফাজত, ৪- স্বামীর আনুগত্য করুণ এতে জান্নাতের যে কোন দরজা দিয়ে প্রবেশ করতে পারবেন। সহিহ ইবনু হিব্বান, হাদিস নং- ৪১৬৩ ।"))
       movies1.add( Movie("মসজিদে ফজরের সলাত আদায় করে বসে দোয়া জিকির পাঠ করুণ এবং সূর্য উঠে গেলে ২ রাকাত চাস্তের সলাত আদায় করুণ এতে প্রতিদিন নিশ্চিত কবুল ১ টি হজ্জ ও উমরার সওয়াব পাবেন। তিরমিজি, তারগিব হাদিস নং- ৪৬১।"))
       movies1.add( Movie("প্রতিটি ভালো কাজ ডান দিক দিয়ে বিসমিল্লাহ বলে শুরু করা।"))
       movies1.add( Movie("ঘুম থেকে উঠে ঘুমের দুয়া পড়া।"))
       movies1.add( Movie("সকালে ১০০ বার ও বিকালে ১০০ বার সুবহানাল্লাহিল আজিম ওয়া বিহামদিহি পরলে সৃষ্টিকুলের সমস্ত মানুষ থেকে বেশী মর্যাদা দেওয়া হবে। সহিহ আবু দাউদ, হাদিস নং- ৫০৯১। হজরত জাবের (রা.) থেকে বর্ণিত, রাসুল (সা.) ইরশাদ করেন, 'যে ব্যক্তি 'সুবহানাল্লাহিল আজিম ওয়া বিহামদিহি' পাঠ করে, তার জন্য জান্নাতে একটি খেজুরগাছ রোপণ করা হয়। (তিরমিজি : ৩৪৬৪)"))
       movies1.add( Movie("সকালে ও বিকালে ১০০ বার সুবহানাল্লাহ, ১০০ বার আলহামদুলিল্লাহ্, ১০০ বার আল্লাহু আকবার এবং ১০০ বার লা ইলা-হা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু, লাহুল মুলকু ওয়ালাহুল হামদু ওয়াহুয়া ‘আলা কুল্লি শাই’ইন কাদীর পাঠ করলে অগণিত সওয়াব হবে। নাসাই, সহিহ তারগিব, হাদিস নং- ৬৫১।"))
       movies1.add( Movie("বাথরুমে যেতে দুয়া পড়ে বাম পা দিয়ে প্রবেশ করা, বের হওয়ার সময় ডান পা দিয়ে বের হয়ে দুয়া পড়া। [বাথরুমে কোন দুয়া পড়া যাবে না"))
       movies1.add( Movie("ওযুর পূর্বে মিসওয়াক করার অভ্যাস করা। -ওযুর শুরুতে এবং শেষে হাদিসে বর্ণিত দুয়া পড়া।"))
       movies1.add( Movie("ঘর থেকে বের হওয়ার সময় ডান পা দিয়ে দুয়া পড়ে বের হওয়া এবং প্রবেশের সময়ও ডান পা দিয়ে প্রবেশ করে সালাম দেয়া। যদিও ঘরে কেউ না থাকুক না কেন সালাম দেয়া সুন্নাহ, আল্লাহর হুকুম। যদি ঘরে কেউ নাকে তবে এই সালাম ঘরের ফিরিশতাদের জন্য।"))
       movies1.add( Movie("মসজিদে ডান পা দিয়ে দরুদ ও দুয়া পড়ে ঢুকা এবং বাম পা দিয়ে দরুদ ও দুয়া পড়ে বের হওয়া।"))
       movies1.add( Movie("রাস্তার ডানপাশে চলার সর্বোচ্চ চেষ্টা করা। না পারলে ভিন্ন কথা।"))
       movies1.add( Movie("ফরজ সালাত শেষে হাদিসে বর্ণিত যিকির, দুয়ার আমল করা। -ফজর ও মাগরিবের পর সূরা হাশরের শেষ তিন আয়াত পড়া, তিন ক্বুল পড়ে শরীর দম করা, ইত্ত্যাদি হাদিসে বর্ণিত আমল করা।"))
       movies1.add( Movie("আযানের জবাব দেয়া, আযানের পর হাদিসে বর্ণিত দুয়া পড়া। (হাত উত্তোলন না করে) -চলতে ফিরতে ছোট বড় সকলকে সালাম দেয়া। সালাম দিয়ে কথা শুরু ও শেষ করা। শুদ্ধভাবে সালাম দেয়া।"))
       movies1.add( Movie("জামা ও জুতা পরার সময় ডান দিক থেকে পরা এবং খুলার সময় বামদিকে আগে খুলা। সম্ভব হলে হাদিসে বর্ণিত দুয়া মুখস্থ করে আমলের অভ্যাস করা।"))
       movies1.add( Movie("পানি খাওয়ার সময় ৬টি সুন্নত ভালোভাবে মেনে খাওয়ার চেষ্টা করা।"))
       movies1.add( Movie("ভাত বা যেকোন খাবার খাওয়ার সময় সমতল জায়গায় বসে দস্তরখানা বিছিয়ে বিসমিল্লাহ বলে দুয়া পড়ে খাওয়া, কিছু পরে গেলে তুলে ধুয়ে খাওয়া, খাওয়া শেষে আলহামদুলিল্লাহ্ পড়া।"))
       movies1.add( Movie("ঘুমানোর আগে সূরা মূলক তিলাওয়াত করা, তিন ক্বুল(ইখলাস,ফালাক্ব,নাস) পড়ে তিনবার শরীর দম করা, ঘুমের দুয়া পড়া, আয়াতুল কুরসী পড়া, সূরা কাফিরুন পড়ে ডান কাত হয়ে শোয়া।"))
       movies1.add( Movie("ঘুমের মাঝখানে কোন খারাপ স্বপ্ন দেখলে উঠে বামপাশে তিনবার থু থু ফেলা এবং আউযুবিল্লাহি মিনাশ শাইত্বনির রজিম পড়ে আল্লাহর কাছে শয়তানের হাত থেকে পানাহ চাওয়া।"))
       movies1.add( Movie("‘‘কেউ যদি চায় যে তার মূলধন বৃদ্ধি করা হোক এবং বয়স দীর্ঘ করা হোক, তবে তাকে বল সে যেন আত্নীয়তার সম্পর্ক রক্ষা করে।’’ [বুখারী, মুসলিম]"))
       movies1.add( Movie("২টি পবিত্র হারামে (মক্কা ও মাদীনা) সলাত পড়া :-\n" +
               "‘‘আমার এই মাসজিদে সলাত পড়া অন্য কোথাও ১ হাজার বার সলাত পড়ার চেয়েও উত্তম, শুধুমাত্র মাসজিদুল হারাম ছাড়া এবং মসজিদুল হারাম এ সলাত পড়া অন্য কোথাও একশ হাজার বার সলাত পড়ার চেয়ে উত্তম।’’ [আহমাদ, ইব্ন মাজাহ]"))
       movies1.add( Movie("জামা’আতে সলাত পড়া :-\n" +
               "‘‘ জামা’আতে সলাত পড়া একাকী সলাত পড়ার চাইতে ২৭ গুন বেশী মর্যাদার।’’ [বুখারী, মুসলিম]"))
       movies1.add( Movie("ইশা এবং ফজর জামা’আতে পড়া :-\n" +
               "‘‘যে ব্যক্তি ইশার সলাত জামা’আতে পড়ল সে যেন অর্ধেক রাত ইবাদাত করল। আর যে ব্যক্তি ফজরের সলাত জামা’আতে পড়ল সে যেন পুরো রাত ইবাদাত করল।’’ [মুসলিম]"))
       movies1.add( Movie("নফল সলাত বাসায় পড়া :-\n" +
               "‘‘ফরজ সলাত ছাড়া মানুষের সলাতের মধ্যে সেই সলাত উৎকৃষ্ট, যা সে ঘরে পড়ে।’’ [বুখারী , মুসলিম]"))
       movies1.add( Movie("জুম’আহ র দিনের ইবাদাত গুলো পালন করা :-\n" +
               "‘‘যে জুমু’আহর দিনে গোসল করে , তারপর প্রথম খুৎবার পূর্বেই উপস্থিত থাকে, পায়ে হেটেঁ আসে, ইমামের কাছে বসে এবং মনোযোগ দিয়ে খুৎবা শুনে ও কোন কথা না বলে -- তাহলে প্রতিটি পদক্ষেপের বিনিময়ে একবছর সলাত পড়া ও রোজা রাখার সমান সওয়াব পাবে।’’ (আহল-আস-সুনান) হজরত আউস ইবনে আউস আস্সাকাফি (রা.) বলেন, আমি রাসুল (সা.)-কে বলতে শুনেছি, 'যে ব্যক্তি জুমার দিন উত্তমরূপে গোসল করবে, অতঃপর কোনো রকম যানবাহনে না চড়ে হেঁটে আগে আগে মসজিদে যাবে, ইমামের নিকটবর্তী বসবে, চুপ থাকবে এবং অনর্থক কথা বলা থেকে বিরত থাকবে, তবে তার জন্য বাড়ি থেকে মসজিদ পর্যন্ত প্রতি কদমে এক বছরের রোজা ও কিয়ামুল লাইলের সওয়াব লেখা হবে। (আবু দাউদ : ৩৪৫)"))
       movies1.add( Movie("দোহার (ইশরাক) সলাত পড়া :-\n" +
               "‘‘যে ব্যক্তি ফজরের সলাত জামা’আতের সাথে পড়ে, তারপর সূর্য ওঠার আগ পর্যন্ত আল্লাহর যিকর করে, তারপর দু’ রাকাআত সলাত পড়ে, সে যেন হজ্জ এবং ওমরাহর সওয়াব পূর্ণ করল। [রসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম একথাটি ৩বার জোড়ে জোড়ে পুনরাবৃত্তি করলেন। [আত-তিরমিজি]"))
       movies1.add( Movie("ইলমের জন্য মাসজিদে যাওয়া :-\n" +
               "‘‘যে দুনিয়াবি কোন কারন ছাড়া দ্বীনি ইলম শিখা বা শিখানোর উদ্দেশ্যে মাসজিদে যায়, সে ঐ ব্যক্তির মত যে তার হজ্জ পূর্ণ করেছে।’’ [আত তাবারানী]"))
       movies1.add( Movie("রমজানে ওমরাহ পালন করা :-\n" +
               "‘‘রমজানে ওমরাহ করা আমার সাথে হজ্জ করার সমান।’’ [বুখারী]"))
       movies1.add( Movie("মসজিদে ফরজ সলাত আদায় করা :-\n" +
               "‘‘যে ব্যক্তি নিজের গৃহ থেকে পবিত্রতা অর্জন করে (অজু ও প্রয়োজনে গোসলও করে) আল্লাহর গৃহের মধ্য থেকে কোন একটি গৃহের দিকে যায়, আল্লাহর ফরজের মধ্য থেকে কোন একটি ফরজ আদায় করার উদ্দেশ্যে, তার একটি পদক্ষেপে একটি গুনাহ ক্ষমা করা হয় এবং অন্য পদক্ষেপটি তার একটি মর্যাদা উন্নত করে।’’"))
       movies1.add( Movie("জামা’আতে প্রথম সারিতে দাড়ানোর চেষ্টা করা :-\n" +
               "‘‘রসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম) প্রথম সারির জন্য ৩ বার এবং দ্বিতীয় সারির জন্য ১ বার ক্ষমা প্রার্থনা করতেন।’’ [আন নাসাঈ, ইবন মাজাহ]"))
       movies1.add( Movie("মাদীনার মাসজিদুল কুবায় সলাত পড়া :-\n" +
               "‘‘যে ব্যক্তি ঘর থেকে নিজেকে পবিত্র করে, তারপর মাসজিদুল কু’বায় আসে এবং সলাত পড়ে, সে যেন ওমরাহর সওয়াব পেল।’’ [আন নাসাঈ, ইবন মাজাহ]"))
       movies1.add( Movie("আযানের জবাব দেয়া :-\n" +
               "‘‘যখন তোমরা আযান শুনতে পাও তখন মুয়াজ্জিন যা বলে তার পুনরাবৃত্তি করে যাও। যখন আযান শেষ হয় তখন (দোয়া )চাও, তোমাকে দেয়া হবে।’’ [আবু দাউদ, আন নাসাঈ]"))
       movies1.add( Movie("রমজানের এবং শাওয়ালের রোজা রাখা :-\n" +
               "‘‘যে ব্যক্তি রমজানের রোজা রাখলো, তারপর শাওয়ালের ৬টি রোজা রাখলো সে যেন এক বছর রোজা রাখলো।’’ [মুসলিম]"))
       movies1.add( Movie("প্রত্যেক মাসে ৩টি রোজা রাখা :-\n" +
               "‘‘প্রত্যেক মাসে ৩টি রোজা রাখা সারা বছর রোজা রাখার সমান।’’ [বুখারী, মুসলিম]"))
       movies1.add( Movie("রোজাদার ব্যক্তিকে ইফতারি করানো :-\n" +
               "‘‘যে ব্যক্তি কোন রোজাদারকে ইফতার করায় সে তার (রোজাদার) সমান প্রতিদান পায়, কিন্তু এর ফলে রোজাদারের প্রতিদানের মধ্যে কোন কমতি হবে না।’’ [তিরমিজি, ইবন মাজাহ]"))
       movies1.add( Movie("লাইলাতুল ক্বদরে ইবাদাত করা :-\n" +
               "‘‘মর্যাদাপূর্ণ এ রাতটি হাজার মাসের চেয়ে উত্তম’’। [ক্বদর, ৯৭:৩]"))
       movies1.add( Movie("জিহাদ :-\n" +
               "‘‘একজন ব্যক্তির আল্লাহর পথে জিহাদের সারিতে দাড়ানো, ৬০ বছর ইবাদাতের চেয়েও উত্তম।’’ [আল-হাকিম]"))
       movies1.add( Movie("রিবাত (রাত জেগে ইবাদাত করা) :-\n" +
               "‘‘একদিন ও একরাত স্বদেশের (মুসলিম দেশের সীমান্ত, যেখানে শত্রুর হামলার আশংখা আছে) সীমান্ত পাহারা দেয়া এক মাস ধরে রোজা রাখা ও রাতে ইবাদাত করার চাইতে বেশী মূল্যবান। এ অবস্থায় যদি সে মারা যায় তাহলে যে কাজ সে করে যাচ্ছিল, মারা যাবার পরও তা তার জন্য জারী থাকবে। তার রিযকও জারী থাকবে এবং কবরের পরীক্ষা থেকেও সে থাকবে সুরক্ষিত। য[মুসলিম]"))
       movies1.add( Movie("যুল হিজ্জা এর প্রথম ১০ দিন বেশী বেশী ইবাদাত করা :-\n" +
               "‘‘এমন কোন দিন নেই যেদিনে কৃত আমল এসব দিন অর্থাৎ যুল হিজ্জা এর প্রথম ১০দিনের নেক আমলের মত আল্লাহর কাছে সর্বাধিক প্রিয়।’’ সাহাবীরা জিজ্ঞেস করলেন, ‘‘ইয়া রসূলুল্লাহ! আল্লাহর পথে জিহাদের মত (নেকী) আমল ও কি নয়?’’ তিনি বললেন: ‘‘না, আল্লাহর পথে জিহাদের মত (নেকী) আমলও নয়। তবে যে ব্যক্তি তাদের জান ও মাল নিয়ে আল্লাহর পথে বের হল এবং এর কোনটা নিয়েই আর ফিরে আসল না সে ছাড়া।’’ [বুখারী]"))
       movies1.add( Movie("কুরআনের সূরা গুলো বার বার তিলাওয়াত করা :-\n" +
               "‘ক্বুল হুওয়াল্লাহু আহাদ’ কুরআনের এক তৃতীয়াংশ এবং ‘ক্বুল ইয়া আইযুহাল কাফিরুন’ কুরআনের চার ভাগের এক ভাগ।’’’ [আত তাবারানী]"))
       movies1.add( Movie("ইসতিগফার করা :-\n" +
               "‘‘যে ব্যক্তি ঈমানদার নারী পুরুষের জন্য ইসতিগফার করে, আলাহ প্রত্যেকের জন্য ১টি করে নেক আমল লিখে দেন।-রিয়াদুস সালেহিনম: ৫১\n" +
               "মানুষের প্রয়োজন পূরণ করা :-\n" +
               "‘‘ যে ব্যক্তি তার মুসলমান ভাইয়ের প্রয়োজন পূরণ করে, আলাহ তার প্রয়োজন পূর্ণ করে দেন। যে ব্যক্তি তার মুসলমান ভাইয়ের কোন অসুবিধা (বিপদ) দূর করে দেয়, আলাহ এর বিনিময়ে কিয়ামাতের দিন তার কষ্ট ও বিপদের অংশ বিশেষ দূর করে দিবেন।’’"))
       movies1.add( Movie("যিকর :-\n" +
               "‘‘সুবহানালা-হি ওয়াল হামদু লিলা-হি, ওয়ালা ইলা-হা ইলালাহ-হু আলাহু আকবার’’ এই কালিমা গুলো বলা, সূর্য যে সমস্ত জিনিসের ওপর উদিত হয়, সেই সমুদয় জিনিসের অপেক্ষা অধিকতর প্রিয়।’ [মুসলিম]"))
       movies1.add( Movie("‘‘আলাহ কি তোমাদের জন্য ইশার সলাত জামা’আতে পড়া হজ্জের সমান এবং ফজরের সলাত জামা’আতে পড়া ওমরাহর সমান করেন নি’’ এবং ‘‘যে ফরজ সলাত জামা’আতে পড়ার জন্য হেঁটে যায়, তা হজ্জের সমান এবং যে নফল সলাত পড়ার জন্য হেঁটে যায়, তার সওয়াব নফল ওমরাহর সমান।’’ (সহীহ আল জামি: ৬৪৩২)"))
       movies1.add( Movie("‘যে ব্যক্তি ফজরের সলাত জামা’আতের সাথে পড়ে, তারপর সূর্য ওঠার আগ পর্যন্ত আলাহর যিকর করে, তারপর দু’ রাকাআত সলাত পড়ে, সে যেন হজ্জ এবং ওমরাহর সওয়াব পূর্ণ করল। [রসূলুলাহ সালালাহু আলাইহি ওয়া সালাম একথাটি ৩বার জোড়ে জোড়ে পুনরাবৃত্তি করলেন।] [আত-তিরমিজি ‘‘সাহাবীরা বললেন, ‘‘ ইয়া রসূলুলাহ! ধনীরা তো আখিরাতে বেশী পুরস্কার পাবে, তারা হজ্জ আদায় করে, আমরা পারিনা, তারা জিহাদ করে এবং আমরা পারিনা। মুহাম্মাদ (সালালাহু আলাইহি ওয়া সালাম) বললেন, ‘‘আমি কি তোমাদের এ রকম কিছুর কথা বলব না, যদি তোমরা এটি শক্ত করে ধরে রাখ, তাহলে তোমরা তাদেও মত সওয়াব অর্জন করতে পারবে। তাহল প্রত্যেক সলাতের পর আলাহু আকবার ৩৪ বার, সুবহান আলাহ ৩৩ বার এবং আলহামদুলিলাহ ৩৩ বার বলা।’’"))
       movies1.add( Movie("‘‘যখন কেউ তার ভাইয়ের জন্য দো’আ করে, তখন ফিরিশতারা বলেন,‘ আমিন, তোমার জন্যও তা।’’ [সাহীহ আল জামি: ২১৪৩] হে আল্লাহ! অবশ্যই আমি তোমার নিকট কঠিন দুরবস্থা (অল্প ধনে জনের আধিক্য), দুর্ভাগ্যের নাগাল, মন্দ ভাগ্য এবং দুশমন-হাসি থেকে রক্ষা কামনা করছি। (মুসলিম)"))
       movies1.add( Movie("অন্য হাদিসে ইরশাদ হচ্ছে, 'হজরত আবু হুরায়রা (রা.) থেকে বর্ণিত, তিনি বলেন, রাসুল (সা.) ইরশাদ করেন, দুটি বাক্য এমন রয়েছে, যা বলা সহজ, আমলের পাল্লায় অনেক ভারী, আর আল্লাহর কাছেও অধিক পছন্দনীয়। সেটি হলো, 'সুবহানাল্লাহি ওয়া বিহামদিহি সুবহানাল্লাহিল আজিম।' (বুখারি : ৬৪০৬)"))
       movies1.add( Movie("সদকায়ে জারিয়াহ :-\n" +
               "রাসুলুল্লাহ (সা.) ইরশাদ করেন, 'যখন মানুষ মারা যায়, তখন তার আমল বন্ধ হয়ে যায়; কিন্তু তিনটি জিনিস বন্ধ হয় না- সদকায়ে জারিয়াহ, ওই ইলম, যা দ্বারা মানুষ উপকৃত হয়; সুসন্তান, যে তার মৃত বাবার জন্য দোয়া করে। (তিরমিজি : ১৩৭৬)"))
       movies1.add( Movie("সুরা ইখলাছের ফজিলত :-\n" +
               "রাসুল (সা.) ইরশাদ করেন, 'তোমরা কি কেউ প্রতি রাতে কোরআন শরিফের এক-তৃতীয়াংশ তিলাওয়াত করতে অক্ষম? তাহলে সে প্রতি রাতে সুরা ইখলাছ পড়বে। তাহলে কোরআনের এক-তৃতীয়াংশ তিলাওয়াতের সওয়াব পাওয়া যাবে।' (মুসনাদে আহমদ : ২৩৫৫৪)"))
       movies1.add( Movie("গোপনে নফল পড়ার ফজিলত :-\n" +
               "রাসুল (সা.) ইরশাদ করেন, 'জনসম্মুখের তুলনায় লুকিয়ে নফল নামাজ পড়ার মধ্যে ২৫ গুণ বেশি সওয়াব।"))
       movies1.add( Movie("মানুষের উপকার করার ফজিলত :-\n" +
               "রাসুলুল্লাহ (সা.) ইরশাদ করেন, 'কোনো মুসলিম ভাইয়ের প্রয়োজনে কিছুক্ষণ সময় দেওয়া আমার কাছে এক মাস মসজিদে ইতেকাফ করার চেয়েও বেশি পছন্দনীয়।' (আল মু'জামুল কাবির : ১৩৬৪৬)"))
       movies1.add( Movie("আমলের নিয়তেও সওয়াব মেলে :-\n" +
               "রাসুল (সা.) ইরশাদ করেন, 'যদি কোনো ব্যক্তি রাতে শয়নকালে এই নিয়ত করে যে সে রাতে উঠে নামাজ পড়বে; কিন্তু প্রচণ্ড ঘুমের কারণে সকাল হয়ে যায়, তাহলে সে তার নিয়ত অনুযায়ী নামাজের সওয়াব পাবে। আর ঘুমটা আল্লাহর পক্ষ থেকে তার জন্য সদকাস্বরূপ হবে। (নাসায়ি : ১৭৮৭)"))
       movies1.add( Movie("রোগী দেখার ফজিলত :-\n" +
               "রাসুলুল্লাহ (সা.) ইরশাদ করেন, 'যে ব্যক্তি কোনো মুসলমান ভাইয়ের রোগের খোঁজখবর নেয়, আল্লাহ সত্তর হাজার ফেরেশতাকে তার মাগফিরাতের দোয়ায় নিযুক্ত করে দেন। সে দিনের যে সময়ই তা করবে, ফেরেশতারা সন্ধ্যা পর্যন্ত তার জন্য দোয়া করবে। আর রাতের যে সময়ই করবে, ফেরেশতারা ফজর পর্যন্ত তার জন্য দোয়া করবে।' (মুসনাদে আহমদ : ৯৫৫)"))
       movies1.add( Movie("বিশুদ্ধ নিয়ত :-\n" +
               "নিয়ত অর্থ সংকল্প। এটি মনের সঙ্গে সংশ্লিষ্ট একটি আমল। প্রত্যেক কাজ, তা দ্বীনী কাজ হোক কিংবা দুনিয়াবী, শুরুতেই নিয়তকে শুদ্ধ করা কর্তব্য। সব কাজ আল্লাহর সন্তুষ্টির জন্য করার সংকল্পই হচ্ছে বিশুদ্ধ নিয়ত। এই নিয়ত মুমিন বান্দার ব্যক্তিগত জীবন থেকে শুরু করে রাষ্ট্রীয় পর্যায় পর্যন্ত প্রায় সকল কাজকেই নেকির কাজে পরিণত করতে পারে। হাদিসে আছে, হজরত উমর ইবনে খাত্তাব (রা.) হতে বর্ণিত, তিনি বলেন, আমি নবী করিম (সা.) কে বলতে শুনেছি, নিশ্চয়ই সব আমল নিয়তের ওপর নির্ভরশীল। আর প্রত্যেক ব্যক্তি তাই পাবে যার নিয়ত সে করবে। অতএব যে ব্যক্তি আল্লাহ ও তার রাসূলের উদ্দেশ্যে হিজরত করবে তার হিজরত আল্লাহ ও তার রাসূলের জন্যই হবে। আর যে দুনিয়া লাভের জন্য কিংবা কোনো নারীকে বিয়ের উদ্দেশ্যে হিজরত করবে তার হিজরত উক্ত বিষয়ের জন্যই হবে, যার জন্য সে হিজরত করেছিল। -সহিহ বোখারি, হাদিস- ১; সহিহ মুসলিম হাদিস- ১৯০৭"))
       movies1.add( Movie("আবু যর রা: থেকে রেওয়ায়েত করেছেন যে, রাসূলুল্লাহ (সঃ)বলেছেনঃ-\n" +
               "তিন ব্যাক্তির সাথে রোজ কিয়ামতে আল্লাহ পাক কথা বলবেন না । তাদের দিকে দৃষ্টিপাত করবেন না। তাদের কে পবিত্র করবেন না । আর তদের জন্য রয়েছে ভীষন আযাব। রেওয়ায়েতকারী বলেন তিনি এ আয়াতটি তিনবার পড়লেন । আবু যর রা: বললেন, ইয়া রাসূলুল্লাহ (সঃ), তারা কারা? তিনি বললেন, তারা হল: যে ব্যাক্তি টাখনুর নিচে কাপড় ঝুলিয়ে পড়ে , যে ব্যাক্তি দান করে খোটা দেয় এবং যে ব্যাক্তি মিথ্যা শপথ করে মাল বিক্রি করে। (মুসলিম-ঈমান পর্ব:১৯৫)"))
       movies1.add( Movie("হজরত নবী করিম (সা.) বলেছেন, কোনো সৎ কাজকেই কখনো তুচ্ছ জ্ঞান করবে না। যদিও তা হয় তোমার ভাইয়ের সঙ্গে হাসিমুখে সাক্ষাত। -সহিহ মুসলিম কারণ এই ধরনের সহজ আমলের মধ্যেও অনেক সময় নিহিত থাকে অনেক প্রাপ্তি ও পুরষ্কার। হাদিস শরিফে এমন অনেক আমলের বর্ণনা পাওয়া যায়, যা করতে সহজ, কিন্তু এর বিশাল প্রাপ্তি ও পুরষ্কারের কথা নবী করিম (সা.) ঘোষণা করেছেন।"))
       movies1.add( Movie("আন-নওয়াস বিন সাম’আন রাদিয়াল্লাহু ‘আনহু হতে বর্ণিত হয়েছে, তিনি নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেছেন, নবী সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বলেন: “উত্তম চরিত্র হচ্ছে নেকী, আর গোনাহ্ তাকে বলে যা তোমার মনকে সংশয়ের মধ্যে ফেলে এবং তা লোকে জানুক তা তুমি অপছন্দ কর।”[মুসলিম: ২৫৫৩]"))
       movies1.add( Movie("আবূ হুরায়রা (রাঃ) বর্ণনা করেছেন :-\n" +
               " আল্লাহ্\u200Cর রাসূল(সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ যে ব্যক্তি জুমু‘আর দিন জানাবাত গোসলের ন্যায় গোসল করে এবং সালাতের জন্য আগমন করে সে যেন একটি উট কুরবানী করল। যে ব্যক্তি দ্বিতীয় পর্যায়ে আগমন করে সে যেন একটি গাভী কুরবানী করল। তৃতীয় পর্যায়ে যে আগমন করে সে যেন একটি শিং বিশিষ্ট দুম্বা কুরবানী করল। চতুর্থ পর্যায়ে যে আগমন করল সে যেন একটি মুরগী কুরবানী করল। পঞ্চম পর্যায়ে যে আগমন করল সে যেন একটি ডিম কুরবানী করল। পরে ইমাম যখন খুত্\u200Cবা দেয়ার জন্য বের হন তখন মালাইকা (ফেরেশতাগণ) যিক্\u200Cর শ্রবণের জন্য উপস্থিত হয়ে থাকে। সহিহ বুখারী, হাদিস নং ৮৮১"))
       movies1.add( Movie("রাসূল (সা:) বলেন.... \"অন্ধকারের মধ্যে যাহারা মসজিদে বেশী বেশী যাতায়ত করে, কেয়ামতের দিনের জন্য তাহাদেরকে পূর্ণ নূরের সুসংবাদ শুনাও।\" —(আল হাদীস"))
       movies1.add( Movie("হযরত আবু হুরইরহ রদিয়াল্লহু আ’নহু\n" +
               "(أبىْ هريْرة رضى الله عنْه)\n" +
               "হইতে বর্ণিত আছে যে, রসুলুল্লহ সল্লাল্লহু আ’লাইহি ওয়া সাল্লাম এরশাদ করিয়াছেন, (যখন) কোন বান্দা অন্তরের এখলাসের সহিত, লা ইলাহা ইল্লাল্লহ বলে, তখন এই কালেমার জন্য নিশ্চিতরূপে আসমানের দরজাসমূহ খুলিয়া দেওয়া হয়। এমনকি এই কালেমা সোজা আরশ পর্যন্ত পৌঁছিয়া যায়। অর্থাৎ সাথে সাথেই কবুল হইয়া যায়। তবে শর্ত হইল, যদি এই কালেমা পাঠকারী কবীরা গুনাহ হইতে বাঁচিয়া থাকে। (তিরমিযী)"))
       movies1.add( Movie("ভালো কাজ মন্দ কাজকে মুছে দেয় :-\n" +
               "আবূ যার জুনদুব বিন জুনাদাহ্ এবং আবূ আব্দুর রহমান মু’আয বিন জাবাল রাদিয়াল্লাহু ‘আনহুমা হতে বর্ণিত আছে, তারা বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বলেছেন: “তুমি যেখানে যে অবস্থায় থাক না কেন আল্লাহকে ভয় কর এবং প্রত্যেক মন্দ কাজের পর ভাল কাজ কর, যা তাকে মুছে দেবে; আর মানুষের সঙ্গে ভাল ব্যবহার কর।” [তিরমিযী: ১৯৮৭, এবং (তিরমিযী) বলেছেন যে, এটা হচ্ছে হাসান হাদীস। কোন কোন সংকলনে এটাকে সহীহ্ (হাসান) বলা হয়েছে।]"))

        val ran=Random()




        for (i in movies1) {
            val randornumber= ran.nextInt(movies1.size)
            movies.add(
                Movie(


                    movies1.get(randornumber).overview
                )
            )
        }

        viewPager.adapter = MovieAdapter(movies,this@MainActivity)


        viewPager.autoSlideTime = CardSliderViewPager.STOP_AUTO_SLIDING
        viewPager.smallScaleFactor =  0.8f
       viewPager.smallAlphaFactor = 1f




    }

    public fun shareIt( str:String) {
        val sharingIntent = Intent(Intent.ACTION_SEND)
        sharingIntent.type = "text/plain"
        sharingIntent.putExtra(android.content.Intent.EXTRA_SUBJECT, "Application")
        sharingIntent.putExtra(android.content.Intent.EXTRA_TEXT, str)
        startActivity(Intent.createChooser(sharingIntent, "Share via"))
    }


    override fun onBackPressed() {
      

        if (doubleBackToExitPressedOnce) {
            super.onBackPressed()
            return
        }

        this.doubleBackToExitPressedOnce = true
        Toast.makeText(this, "Please click BACK again to exit", Toast.LENGTH_SHORT).show()

        Handler().postDelayed(Runnable { doubleBackToExitPressedOnce = false }, 2000)
    }
}
